#include <iostream>
#include <string>
#include <stdlib.h>
#include "User.h"
#include "Editor.h"
#include "Work.h"
#include "BD.h"
#include "Archive.h"
#include "Superuser.h"
#include "exceptions.h"

using namespace std;

string description() {
	setlocale(LC_CTYPE, "Russian");
	string text = "Project is designed by Duda Volodimir\ngroup IS-73\nShort description:\n<<<Моделювання створення бiблiотек освiтнього контенту з персональними треками>>>\nОсновна цiль – збереження iнформацii для повсякденного використання та архiвування для майбутнiх поколiнь.\nКожен користувач має право реєструваватись в ЕБ(електрону бiблiотеку), додавати(редагувати/видаляти) свою\niнформацiю та переглядати iнформацiю вiд iнших користувачiв(в тому числi наукових спiлок). Далi редактор\n(вiддiл редакторiв) повинен переглядати статтi/науковi роботи та вирiшувати чи зберiгати, чи нi, чи повертати \nна редагування користувачу. Також редактор має права на змiни робiт самостiйно. В кiнцi роботи йдуть на\nавтоматичну класифiкацiю та збереження до швидкої БД(бази данних). Та за основною метою, вся \niнформацiя повинна зберiгатись в так званих iнформацiйних архiвах(надiйнi сховища iнформацiї, якi розташованi\nпо всьому свiту). Там iнформацiя повинна перевiрятись та вiдновлюватись у випадку\nпорушення сталостi.\n";
	return text;
}

